doc/BUILD/source/_static/soap_outputs/6.5.314.4301/create_sensor_from_json_step_6_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <sensor>
          <category>Operating System</category>
          <name>Is Mac API TEST</name>
          <hidden_flag>0</hidden_flag>
          <delimiter>,</delimiter>
          <creation_time>2015-09-14T13:39:12</creation_time>
          <exclude_from_parse_flag>0</exclude_from_parse_flag>
          <last_modified_by>Administrator</last_modified_by>
          <string_count>0</string_count>
          <modification_time>2015-09-14T13:39:12</modification_time>
          <ignore_case_flag>1</ignore_case_flag>
          <max_age_seconds>86400</max_age_seconds>
          <value_type>String</value_type>
          <source_id>0</source_id>
          <description>Returns whether the machine is a Mac.  True if so, False if not.
Example: True</description>
          <queries>
            <query>
              <platform>Windows</platform>
              <script_type>VBScript</script_type>
              <script>&amp;#039;========================================
&amp;#039; Is Mac
&amp;#039;========================================

Wscript.echo &amp;quot;False&amp;quot;</script>
            </query>
            <query>
              <platform>Linux</platform>
              <script_type>UnixShell</script_type>
              <script>#!/bin/bash
echo False</script>
            </query>
            <query>
              <platform>Mac</platform>
              <script_type>UnixShell</script_type>
              <script>#!/bin/bash
echo True</script>
            </query>
            <query>
              <platform>Solaris</platform>
              <script_type>UnixShell</script_type>
              <script>#!/bin/bash
echo False</script>
            </query>
            <query>
              <platform>AIX</platform>
              <script_type>UnixShell</script_type>
              <script>#!/bin/bash
echo False</script>
            </query>
          </queries>
        </sensor>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>